{
  "abiu": "High in vitamin A for eye health and fiber for digestion. Good for immune support.",
  "acai": "Packed with antioxidants for cellular protection. Great for energy boosts.",
  "acerola": "Extremely high in vitamin C for immunity. Excellent for skin health.",
  "ackee": "Contains healthy fats for heart health. WARNING: Toxic if unripe.",
  "ambarella": "Rich in vitamin C for immunity and iron for blood health. Good for anemia prevention.",
  "apple": "High in fiber for digestion and quercetin for allergy relief. Great for gut health.",
  "apricot": "Rich in beta-carotene for eye health and potassium for muscles. Good for vision.",
  "avocado": "Packed with heart-healthy monounsaturated fats. Excellent for brain function.",
  "banana": "High in potassium for heart health and quick energy. Great for workouts.",
  "barbadine": "Good source of niacin for metabolism and phosphorus for bones. Supports bone health.",
  "barberry": "Contains berberine for liver health. Good for detoxification.",
  "betel_nut": "Stimulant properties for energy. WARNING: Controversial health effects.",
  "bitter_gourd": "Helps regulate blood sugar levels. Excellent for diabetes management.",
  "black_berry": "High in ellagic acid for cancer prevention. Great for antioxidant boost.",
  "black_mullberry": "Contains resveratrol for heart health. Good for circulation.",
  "brazil_nut": "Extremely high in selenium for thyroid function. Just 1 nut meets daily needs.",
  "camu_camu": "Highest natural vitamin C content for immunity. Superb for cold prevention.",
  "cashew": "Good source of zinc for immunity. The cashew apple is also edible and nutritious.",
  "cempedak": "High in fiber for digestion and vitamin B6 for mood. Good for gut health.",
  "chenet": "Contains latex-like sap with potential medicinal uses. A tropical rarity.",
  "cherimoya": "Rich in B vitamins for energy. WARNING: Seeds are toxic.",
  "chico": "Sweet fruit good for digestion. Has a unique grainy texture.",
  "chokeberry": "Packed with anthocyanins for brain health. Excellent for memory.",
  "cluster_fig": "High in prebiotic fiber for gut health. Good for microbiome balance.",
  "coconut": "Contains MCTs for quick energy and electrolytes for hydration. Great for athletes.",
  "corn_kernel": "Good source of lutein for eye health. High in starchy carbohydrates.",
  "cranberry": "Prevents UTIs with proanthocyanidins. Excellent for urinary health.",
  "cupuacu": "Contains theobromine for mood enhancement. A chocolate relative.",
  "custard_apple": "Rich in magnesium for muscle relaxation. Good for stress relief.",
  "damson": "High in anthocyanins for anti-aging. Tart flavor when raw.",
  "dewberry": "Good source of vitamin E for skin. Similar to blackberries.",
  "dragonfruit": "High in prebiotic fiber for digestion. Excellent for gut health.",
  "durian": "Contains tryptophan for better sleep. Famous for its strong odor.",
  "eggplant": "Rich in nasunin for brain health. Good grilled or roasted.",
  "elderberry": "Powerful antiviral properties. Excellent for immune support.",
  "emblic": "Traditional Ayurvedic rejuvenator. Supports overall vitality.",
  "feijoa": "High in iodine for thyroid function. Tastes like pineapple-guava.",
  "fig": "Good source of calcium for bones. Naturally sweet and versatile.",
  "finger_lime": "Packed with vitamin C. Has unique caviar-like texture.",
  "gooseberry": "High in vitamin C for collagen production. Tart and refreshing.",
  "goumi": "Related to goji berries. Contains beneficial plant compounds.",
  "grape": "Rich in resveratrol for heart health. Good for longevity.",
  "grapefruit": "Contains naringin for metabolism. Excellent for weight management.",
  "greengage": "High in chlorogenic acid for blood sugar balance. Sweet plum variety.",
  "grenadilla": "Type of passion fruit. High in fiber for digestion.",
  "guava": "Packed with lycopene for skin protection. Seeds are edible.",
  "hard_kiwi": "Higher in vitamin C than regular kiwi. Fuzzy skin is edible.",
  "hawthorn": "Supports heart health. Used in traditional medicine.",
  "hog_plum": "Tart fruit popular in Caribbean cuisine. Good for jams.",
  "horned_melon": "High in electrolytes for hydration. Unique spiky appearance.",
  "indian_strawberry": "Mostly ornamental. Mild flavor with little nutrition.",
  "jaboticaba": "Grows directly on tree trunks. Rich in antioxidants.",
  "jackfruit": "High in magnesium for nerves. Meat-like texture when cooked.",
  "jalapeno": "Contains capsaicin for metabolism. Adds spice to dishes.",
  "jamaica_cherry": "Tart and high in vitamin C. Small berry-like fruit.",
  "jambul": "Traditionally used for diabetes management. Unique flavor.",
  "jocote": "Eaten with salt in Central America. Good source of calcium.",
  "jujube": "Used in Chinese medicine. Sweet date-like fruit.",
  "kaffir_lime": "Aromatic zest used in cooking. Supports digestion.",
  "kumquat": "Edible peel high in fiber. Sweet-tart flavor.",
  "lablab": "High in plant protein and iron. A nutritious legume.",
  "langsat": "Good source of B vitamins. Similar to longan.",
  "longan": "High in iron for blood health. Sweet and juicy.",
  "mabolo": "Velvety skin and mild flavor. Contains some calcium.",
  "malay_apple": "Very hydrating. Crisp texture like apples.",
  "mandarine": "Easy to peel citrus. Contains some stimulant compounds.",
  "mango": "High in vitamin A for skin. Contains digestive enzymes.",
  "mangosteen": "Rich in xanthones for inflammation. Tropical delicacy.",
  "medlar": "Must be bletted (softened) before eating. Unique texture.",
  "mock_strawberry": "Mostly ornamental. Minimal nutritional value.",
  "morinda": "Also called noni fruit. Used in traditional medicine.",
  "mountain_soursop": "More acidic than regular soursop. High in vitamin C.",
  "oil_palm": "High in vitamin E for skin. Controversial due to farming practices.",
  "olive": "Rich in heart-healthy oleic acid. Brined before eating.",
  "otaheite_apple": "Mildly astringent. Low in calories.",
  "papaya": "Contains papain enzyme for digestion. Sweet and tropical.",
  "passion_fruit": "Very high in fiber. Tart and aromatic.",
  "pawpaw": "Largest native North American fruit. Creamy texture.",
  "pea": "Good plant protein source. High in vitamin K.",
  "pineapple": "Contains bromelain for inflammation. Sweet and tangy.",
  "plumcot": "Plum-apricot hybrid. Higher nutrients than parents.",
  "pomegranate": "Rich in punicalagins for heart health. Juicy seeds.",
  "prikly_pear": "Cactus fruit high in betanin for inflammation.",
  "quince": "Astringent when raw. High in pectin for jams.",
  "rambutan": "Hairy exterior. Good source of iron.",
  "raspberry": "Contains ketones that may aid weight loss. Delicate flavor.",
  "redcurrant": "High in potassium. Tart berry good for sauces.",
  "rose_hip": "Extremely high in vitamin C. Used in herbal teas.",
  "rose_leaf_bramble": "Edible petals. Delicate floral flavor.",
  "salak": "Snake fruit with astringent taste. Unique scale-like skin.",
  "santol": "Woody exterior. Sweet-sour flavor profile.",
  "sapodilla": "Good source of iron and folate. Very sweet.",
  "sea_buckthorn": "Rich in rare omega-7 for skin repair. Tart berries.",
  "strawberry_guava": "Higher vitamin C than regular guava. Tropical flavor.",
  "sugar_apple": "High in B vitamins for energy. Creamy texture.",
  "tamarind": "Tartaric acid aids digestion. Used in many cuisines.",
  "taxus_baccata": "WARNING: Highly toxic. Seeds contain cardiac poisons.",
  "ugli_fruit": "Citrus hybrid. Easy to peel and section.",
  "white_currant": "Contains silica for hair/nails. Milder than red currants.",
  "yali_pear": "High fiber and low glycemic. Good for blood sugar.",
  "yellow_plum": "Rich in vitamin K for blood health. Sweet and juicy."
}